<a href="https://colab.research.google.com/github/noushadkhan01/MySql/blob/master/full_A_Z.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Install MySQL Driver
Python needs a MySQL driver to access the MySQL database.

In [0]:
import mysql.connector

# LINKS:--

## [distinct](#DISTINCT)
## [between](#BETWEEN)

# Create Connection
Start by creating a connection to the database.

Use the username and password from your MySQL database:

In [0]:
import mysql.connector

mydb = mysql.connector.connect(
    host = 'localhost',
    user = 'user',
    #passwd = 'Jannat@1214'
    )
print(mydb)

<mysql.connector.connection.MySQLConnection object at 0x00000248FE479D30>

# Creating a Database
To create a database in MySQL, use the "CREATE DATABASE" statement:

## mydb.cursor()

In [0]:
import mysql.connector

mydb = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    passwd = 'hr5739'
)
print(mydb)
mycursor = mydb.cursor()
print(mycursor)
mycursor.execute("CREATE DATABASE users")

<mysql.connector.connection.MySQLConnection object at 0x0000021E9FA195F8>
MySQLCursor: (Nothing executed yet)

## Check if Database Exists

You can check if a database exist by listing all databases in your system by using the 
### "SHOW DATABASES" 
statement:

In [0]:
mycursor.execute('SHOW DATABASES')
for x in mycursor:
    print(x)

('information_schema',)
('mydatabase',)
('mysql',)
('performance_schema',)
('test',)
('users',)

### Try connecting to the database "mydatabase":

In [0]:
import mysql.connector
mydb = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    passwd = 'hr5739',
    database = 'users'
)

### ^its executed so database exist

# Creating a Table
To create a table in MySQL, use the 
### "CREATE TABLE" 

statement.

Make sure you define the name of the database when you create the connection

In [0]:
import mysql.connector
mydb = mysql.connector.connect(
host = 'localhost',
user = 'root',
password = 'hr5739',
database = 'users'
)

mycursor = mydb.cursor()
mycursor.execute('CREATE TABLE customers(Account_number INT, \
                 name VARCHAR(255), email VARCHAR(255), \
                 username VARCHAR(255), \
                 password VARCHAR(255), balance INT)')

#### ^^If the above code was executed with no errors, you have now successfully created a table.

# Check if Table Exists
You can check if a database exist by listing all tables in your database by using the 
### "SHOW TABLES" 
statement:

In [0]:
mycursor.execute('SHOW TABLES')
for x in mycursor:
    print(x)

('customers',)

# Primary Key
When creating a table, you should also create a column with a unique key for each record.

This can be done by defining a 
### PRIMARY KEY.
We use the statement 
### "INT AUTO_INCREMENT PRIMARY KEY"
which will insert a unique number for each record. Starting at 1, and increased by one for each record.

In [0]:
try:
    import mysql.connector
    mydb = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    password = 'hr5739',
    database = 'users'
    )

    mycursor = mydb.cursor()
    mycursor.execute('CREATE TABLE customers(Id INT AUTO_INCREMENT PRIMARY KEY, Account_number INT, \
                     name VARCHAR(255), email VARCHAR(255), \
                     username VARCHAR(255), \
                     password VARCHAR(255), balance INT)')
except Exception as e:
    print(f'{type(e).__name__}:-- {e}')

ProgrammingError:-- 1050 (42S01): Table 'customers' already exists

## Create primary key on an existing table:

# ALTER TABLE

In [0]:
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  passwd="hr5739",
  database="users"
)

mycursor = mydb.cursor()

mycursor.execute("ALTER TABLE customers ADD COLUMN id INT AUTO_INCREMENT PRIMARY KEY")

## Insert Into Table
To fill a table in MySQL, use the 
# "INSERT INTO"
statement.

In [0]:
sql = 'INSERT INTO customers (Account_number, name, email, username, password, balance) VALUES (%s , %s, %s, %s, %s, %s)'
val = (2222, 'Noushad Khan', 'Noushadkhan1994@gmail.com', 'fdfdf', 'passowrd@1283434', 10000)
mycursor.execute(sql, val)
mydb.commit()
print(mycursor.rowcount, 'record interted.')

1 record interted.

## ^^Important!: 
Notice the statement: 
# mydb.commit(). 
It is required to make the changes, otherwise no changes are made to the table.

## Insert Multiple Rows
To insert multiple rows into a table, use the 
# executemany() 
method.
The second parameter of the executemany() method is a list of tuples, containing the data you want to insert:

In [0]:
sql = 'INSERT INTO customers (Account_number, name, email, username, password, balance) VALUES (%s , %s, %s, %s, %s, %s)'
val = [
    (2222, 'Noushad Khan', 'Noushadkhan1994@gmail.com', 'fdfdf', 'passowrd@1283434', 10000),
    (333, 'a', 'b', 'c', 'd', 3000), 
    (444, 'aa', 'bb', 'cc', 'dd', 20000)
    ]
mycursor.executemany(sql, val)
mydb.commit()
print(f'{mycursor.rowcount} was inserted.')

3 was inserted.

## Get Inserted ID
You can get the id of the row you just inserted by asking the cursor object.

### Note: 
If you insert more that one row, the id of the last inserted row is returned

print(mycursor.lastrowid)

## Select From a Table
To select from a table in MySQL, use the 
# "SELECT"
statement:

In [0]:
import mysql.connector
mydb = mysql.connector.connect(
    host = 'localhost',
    user = 'root', 
    passwd = 'hr5739', 
    database = 'users'
)
mycursor = mydb.cursor()

In [0]:
mycursor.execute('SELECT * FROM customers')
myresult = mycursor.fetchall()
for x in myresult:
    print(x)

(2222, 'Noushad Khan', 'Noushadkhan1994@gmail.com', 'fdfdf', 'passowrd@1283434', 10000, 1)
(2222, 'Noushad Khan', 'Noushadkhan1994@gmail.com', 'fdfdf', 'passowrd@1283434', 10000, 2)
(333, 'a', 'b', 'c', 'd', 3000, 3)
(444, 'aa', 'bb', 'cc', 'dd', 20000, 4)

In [0]:
import pandas as pd
import sqlalchemy

## Selecting Columns
To select only some of the columns in a table, use the 

# "SELECT" 
statement followed by the column name(s):

In [0]:
mycursor.execute('SELECT Account_number FROM customers')
myresult = mycursor.fetchall()
for i in myresult:
    print(i)

(2222,)
(2222,)
(333,)
(444,)

## Using the 
# fetchone() 
Method
If you are only interested in one row, you can use the
### fetchone() 
method.
The fetchone() method will return the first row of the result:

In [0]:
myresult = mycursor.fetchone()
print(myresult)

None

In [0]:
mycursor.execute('SELECT Account_number FROM customers')
print(mycursor.fetchone())

(2222,)

#### ^^it will fetch the first one from the entire data

# WHERE

### Select With a Filter
When selecting records from a table, you can filter the selection by using the 
### "WHERE"
statement:

## for integer values

In [0]:
import mysql.connector
mydb = mysql.connector.connect(
host = 'localhost',
user = 'root',
passwd = 'hr5739',
database = 'users')
sql = "SELECT * FROM customers WHERE Account_number = 2222"
mycursor.execute(sql)
result = mycursor.fetchall()
for x in result:
    print(x)

(2222, 'Noushad Khan', 'Noushadkhan1994@gmail.com', 'fdfdf', 'passowrd@1283434', 10000, 1)
(2222, 'Noushad Khan', 'Noushadkhan1994@gmail.com', 'fdfdf', 'passowrd@1283434', 10000, 2)

## for string values

In [0]:
import mysql.connector
mydb = mysql.connector.connect(
host = 'localhost',
user = 'root',
passwd = 'hr5739',
database = 'users')
sql = "SELECT * FROM customers WHERE name = 'Noushad Khan'"
mycursor.execute(sql)
result = mycursor.fetchall()
for x in result:
    print(x)

(2222, 'Noushad Khan', 'Noushadkhan1994@gmail.com', 'fdfdf', 'passowrd@1283434', 10000, 1)
(2222, 'Noushad Khan', 'Noushadkhan1994@gmail.com', 'fdfdf', 'passowrd@1283434', 10000, 2)

## Wildcard Characters
You can also select the records that starts, includes, or ends with a given letter or phrase.
Use the 
# %
to represent wildcard characters:

## 1:--  '%word%'

#### Select records where the address contains the word "way":

## LIKE

##### Must Visit Progate:-- https://bit.ly/2ONM1il

In [0]:
sql = "SELECT * FROM customers WHERE name LIKE '%a%'"
mycursor.execute(sql)
result = mycursor.fetchall()
for x in result:
    print(x)

(2222, 'Noushad Khan', 'Noushadkhan1994@gmail.com', 'fdfdf', 'passowrd@1283434', 10000, 1)
(2222, 'Noushad Khan', 'Noushadkhan1994@gmail.com', 'fdfdf', 'passowrd@1283434', 10000, 2)
(333, 'a', 'b', 'c', 'd', 3000, 3)
(444, 'aa', 'bb', 'cc', 'dd', 20000, 4)

## 2:-- 'word%''
this is called prefix search
it return a rows which contains word in the last of specific column

In [0]:
sql = "SELECT * FROM customers WHERE name LIKE 'n%'"
mycursor.execute(sql)
result = mycursor.fetchall()
for x in result:
    print(x)

(2222, 'Noushad Khan', 'Noushadkhan1994@gmail.com', 'fdfdf', 'passowrd@1283434', 10000, 1)
(2222, 'Noushad Khan', 'Noushadkhan1994@gmail.com', 'fdfdf', 'passowrd@1283434', 10000, 2)

## 2:-- '%word''
this is called postfix search
it return a rows which contains word at the starting of specific column

In [0]:
sql = "SELECT * FROM customers WHERE name LIKE '%N'"
mycursor.execute(sql)
result = mycursor.fetchall()
for x in result:
    print(x)

(2222, 'Noushad Khan', 'Noushadkhan1994@gmail.com', 'fdfdf', 'passowrd@1283434', 10000, 1)
(2222, 'Noushad Khan', 'Noushadkhan1994@gmail.com', 'fdfdf', 'passowrd@1283434', 10000, 2)

# NOT

In [0]:
sql = "SELECT * FROM customers WHERE NOT name LIKE '%N'"
mycursor.execute(sql)
result = mycursor.fetchall()
for x in result:
    print(x)

(333, 'a', 'b', 'c', 'd', 3000, 3)
(444, 'aa', 'bb', 'cc', 'dd', 20000, 4)

In [0]:
import mysql.connector
mydb = mysql.connector.connect(
    host = 'localhost',
    user = 'root', 
    passwd = 'hr5739',
    database = 'users'
)
mycursor = mydb.cursor()
sql = "SELECT * FROM customers WHERE NOT name = 'Noushad Khan'"
mycursor.execute(sql)
result = mycursor.fetchall()
for x in result:
    print(x)

(333, 'a', 'b', 'c', 'd', 3000, 3)
(444, 'aa', 'bb', 'cc', 'dd', 20000, 4)


## Getting Rows with NULL Values

In order to select rows that contain a NULL value for some column, we can use 
# IS NULL. 
As in the example below, by using a condition like "where column_name IS NULL" we can find rows in which the value of a certain column is NULL.

### try to create null value by leaving the price empty

In [0]:
try:
    sql = 'INSERT INTO customers (Account_number, name, email, username, password, balance) VALUES (%s , %s, %s, %s, %s, %s)'
    val = (222222, 'fb', 'fb@gmail.com', 'fdfdf', 'passowr')
    mycursor.execute(sql, val)
    mydb.commit()
    print(mycursor.rowcount, 'record interted.')
except Exception as e:
    print(f'{type(e).__name__}:-- {e}')

ProgrammingError:-- Not enough parameters for the SQL statement

#### make balance = NULL

In [0]:
try:
    sql = 'INSERT INTO customers (Account_number, name, email, username, password, balance) VALUES (%s , %s, %s, %s, %s, %s)'
    val = (222222, 'fb', 'fb@gmail.com', 'fdfdf', 'passowr', None)
    mycursor.execute(sql, val)
    mydb.commit()
    print(mycursor.rowcount, 'record interted.')
except Exception as e:
    print(f'{type(e).__name__}:-- {e}')

1 record interted.

In [0]:
sql = 'SELECT * FROM customers WHERE balance IS NULL'
mycursor.execute(sql)
result = mycursor.fetchall()
for i in result:
    print(i)

(222222, 'fb', 'fb@gmail.com', 'fdfdf', 'passowr', None, 5)

##### ^^in this the last one is id

## IS NOT NULL:--
    by this we will get rows with True values means not NULL

# AND Operator:-
If you use AND operator, you can put multiple conditions in a WHERE clause, Using the sturucture 
### 'WHERE' condition1 AND condition2.
you can search for only rows that are true for both conditions.

# OR Operator:--
    Like the AND operator, the OR operator can be used to make SQL statements with multiple conditions. Using the structure 
### "WHERE condition1 OR condition2"
, you can search for rows that meet either one of the conditions (or both).

# Ordering Rows:-
To put rows in order, you can use 
## ORDER BY
in SQL. You can also choose a specific column to use order the rows by, as shown in the example below. You must also specify how the rows should be ordered at the end.

### ORDER BY column_name order_method;

#### order_method = ASC(ascending) or DSC(descending)

In [0]:
sql = 'SELECT * FROM customers ORDER BY balance DESC'
mycursor.execute(sql)
result = mycursor.fetchall()
for i in result:
    print(i)

(444, 'aa', 'bb', 'cc', 'dd', 20000, 4)
(2222, 'Noushad Khan', 'Noushadkhan1994@gmail.com', 'fdfdf', 'passowrd@1283434', 10000, 1)
(2222, 'Noushad Khan', 'Noushadkhan1994@gmail.com', 'fdfdf', 'passowrd@1283434', 10000, 2)
(333, 'a', 'b', 'c', 'd', 3000, 3)
(222222, 'fb', 'fb@gmail.com', 'fdfdf', 'passowr', None, 5)

###### ^^in this last columns is Id

# LIMIT:-
    To set a specific "maximum number of results", you can use LIMIT. 
See how it works in the example below.

In [0]:
sql = 'SELECT * FROM customers ORDER BY balance DESC LIMIT 3'
mycursor.execute(sql)
result = mycursor.fetchall()
for i in result:
    print(i)

(444, 'aa', 'bb', 'cc', 'dd', 20000, 4)
(2222, 'Noushad Khan', 'Noushadkhan1994@gmail.com', 'fdfdf', 'passowrd@1283434', 10000, 1)
(2222, 'Noushad Khan', 'Noushadkhan1994@gmail.com', 'fdfdf', 'passowrd@1283434', 10000, 2)

# DISTINCT
y using 
### DISTINCT 
you can exclude duplicate rows of data from your search results. You can specify the
##### name of a column
to get only unique rows, omitting duplicates. To do this, use the following 
#### syntax: DISTINCT( column_name )

In [0]:
import mysql.connector
mydb = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    passwd = 'hr5739',
    database = 'users'
)
mycursor = mydb.cursor()

sql = 'SELECT DISTINCT(name) FROM customers LIMIT 3'
mycursor.execute(sql)
result = mycursor.fetchall()
for i in result:
    print(i)

('Noushad Khan',)
('a',)
('aa',)

In [0]:
import mysql.connector
mydb = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    passwd = 'hr5739',
    database = 'users'
)
mycursor = mydb.cursor()

sql = 'SELECT DISTINCT ACCOUNT_NUMBER, NAME, EMAIL, USERNAME, PASSWORD, BALANCE FROM customers'
mycursor.execute(sql)
result = mycursor.fetchall()
for i in result:
    print(i)

(2222, 'Noushad Khan', 'Noushadkhan1994@gmail.com', 'fdfdf', 'passowrd@1283434', 10000)
(333, 'a', 'b', 'c', 'd', 3000)
(444, 'aa', 'bb', 'cc', 'dd', 20000)
(222222, 'fb', 'fb@gmail.com', 'fdfdf', 'passowr', None)

# Arithmetic Operations on SQL data
It's possible to do calculations in SQL with the these arithmetic oerators: + , -, /, and *. Using these operators, you can perform calculations on the rows of a specific column.

In [0]:
sql = 'SELECT Account_number, balance*3 FROM customers'
mycursor.execute(sql)
result = mycursor.fetchall()
print(result)

[(2222, 30000), (2222, 30000), (333, 9000), (444, 60000), (222222, None)]

# GROUP BY
The SQL **GROUP BY** clause is used in collaboration with the **SELECT** statement to arrange identical data into groups. This **GROUP BY** cluase follows the **WHERE** clause in as **SELECT** statement and precedes the **ORDER BY** cluase.

The **GROUP BY** clause must follow the conditions in the **WHERE** clause and must precede the **ORDER BY** clause if one is used.

In [0]:
import mysql.connector
mydb = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    passwd = 'hr5739',
    database = 'users'

)

sql = 'SELECT ACCOUNT_NUMBER, NAME, EMAIL, BALANCE FROM CUSTOMERS WHERE BALANCE IS NOT NULL GROUP BY ACCOUNT_NUMBER ORDER BY BALANCE DESC'
mycursor.execute(sql)
for i in mycursor.fetchall():
    print(i)

(444, 'aa', 'bb', 20000)
(2222, 'Noushad Khan', 'Noushadkhan1994@gmail.com', 10000)
(333, 'a', 'b', 3000)

# UPDATE
The SQL **UPDATE** Query is used to modify the existing records in a table. You can use the **WHERE** clause with the **UPDATE** query to update the selected rows, otherwise all the rows would be affected.

In [0]:
mycursor.execute('UPDATE CUSTOMERS SET NAME = \'SAHIL RANA\' WHERE ID = 2')

In [0]:
import mysql.connector
mydb = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    passwd = 'hr5739',
    database = 'users'

)

sql = 'SELECT ACCOUNT_NUMBER, NAME, EMAIL, BALANCE FROM CUSTOMERS WHERE BALANCE IS NOT NULL GROUP BY NAME ORDER BY BALANCE DESC'
mycursor.execute(sql)
for i in mycursor.fetchall():
    print(i)

(444, 'aa', 'bb', 20000)
(2222, 'Noushad Khan', 'Noushadkhan1994@gmail.com', 10000)
(2222, 'SAHIL RANA', 'Noushadkhan1994@gmail.com', 10000)
(333, 'a', 'b', 3000)

# JOINS
The SQL **Joins** clause is used to combine records from two or more tables in a database. A **JOIN** is a means for combining fields from two tables **by using values common to each.**

###### FIRST CREATE 2ND TABLE

In [0]:
try:
    import mysql.connector
    mydb = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    password = 'hr5739',
    database = 'users'
    )

    mycursor = mydb.cursor()
    mycursor.execute('CREATE TABLE CUSTOMERS_RECORD(RID INT AUTO_INCREMENT PRIMARY KEY, DATE date, Account_number INT, CREDIT DECIMAL, DEBIT DECIMAL)')
except Exception as e:
    print(f'{type(e).__name__}:-- {e}')

###### INSERT INTO 2ND TABLE

In [0]:
sql = "INSERT INTO CUSTOMERS_RECORD (DATE, Account_number, CREDIT, DEBIT) VALUES \
('2018-01-01', 22232, 1000.22, 3000.33)"
mycursor.execute(sql)
mydb.commit()
print(mycursor.rowcount, 'record interted.')

1 record interted.

###### CECK

In [0]:
mycursor.execute('SELECT * FROM CUSTOMERS_RECORD')
for i in mycursor.fetchall():
    print(i)

(1, datetime.date(2018, 1, 1), 2222, Decimal('1000'), Decimal('3000'))
(2, datetime.date(2018, 1, 1), 22232, Decimal('1000'), Decimal('3000'))

### JOIN

In [0]:
try:
    import mysql.connector
    mydb = mysql.connector.connect(
        host = 'localhost',
        user = 'root',
        passwd = 'hr5739',
        database = 'users'

    )
    mycursor = mydb.cursor()

    sql = 'SELECT DATE, NAME, DEBIT, \
    CREDIT, BALANCE FROM CUSTOMERS, \
    CUSTOMERS_RECORD WHERE \
    CUSTOMERS.ACCOUNT_NUMBER = CUSTOMERS_RECORD.ACCOUNT_NUMBER'
    mycursor.execute(sql)
    for i in mycursor.fetchall():
        print(i)
except Exception as e:
    print(f'{type(e).__name__}:--{e}')

(datetime.date(2018, 1, 1), 'Noushad Khan', Decimal('3000'), Decimal('1000'), 10000)
(datetime.date(2018, 1, 1), 'Noushad Khan', Decimal('3000'), Decimal('1000'), 10000)

In [0]:
try:
    import mysql.connector
    mydb = mysql.connector.connect(
        host = 'localhost',
        user = 'root',
        passwd = 'hr5739',
        database = 'users'

    )
    mycursor = mydb.cursor()
    sql = 'SELECT DEBIT, CREDIT FROM CUSTOMERS, \
    CUSTOMERS_RECORD WHERE \
    CUSTOMERS.ACCOUNT_NUMBER = CUSTOMERS_RECORD.ACCOUNT_NUMBER'
    mycursor.execute(sql)
    #print('f')
    for i in mycursor.fetchall():
        print(i)
except Exception as e:
    print(f'{type(e).__name__}:--{e}')

(Decimal('3000'), Decimal('1000'))
(Decimal('3000'), Decimal('1000'))

## INNER JOIN

In [0]:
try:
    import mysql.connector
    mydb = mysql.connector.connect(
        host = 'localhost',
        user = 'root',
        passwd = 'hr5739',
        database = 'users'

    )
    mycursor = mydb.cursor()
    sql = '''SELECT CUSTOMERS.ACCOUNT_NUMBER, CUSTOMERS.ID, CUSTOMERS.NAME, CUSTOMERS_RECORD.DATE,
    CUSTOMERS_RECORD.CREDIT, CUSTOMERS_RECORD.DEBIT, CUSTOMERS.BALANCE
    FROM CUSTOMERS
    INNER JOIN
    CUSTOMERS_RECORD 
    ON CUSTOMERS.ACCOUNT_NUMBER = CUSTOMERS_RECORD.ACCOUNT_NUMBER'''
    mycursor.execute(sql)
    for i in mycursor.fetchall():
        print(i)
except Exception as e:
    print(f'{type(e).__name__}:--{e}')

(2222, 1, 'Noushad Khan', datetime.date(2018, 1, 1), Decimal('1000'), Decimal('3000'), 10000)
(2222, 2, 'Noushad Khan', datetime.date(2018, 1, 1), Decimal('1000'), Decimal('3000'), 10000)

# LEFT JOIN

In [0]:
try:
    import mysql.connector
    mydb = mysql.connector.connect(
        host = 'localhost',
        user = 'root',
        passwd = 'hr5739',
        database = 'users'

    )
    mycursor = mydb.cursor()
    sql = '''SELECT CUSTOMERS.ACCOUNT_NUMBER, CUSTOMERS.ID, CUSTOMERS.NAME, CUSTOMERS_RECORD.DATE,
    CUSTOMERS_RECORD.CREDIT, CUSTOMERS_RECORD.DEBIT, CUSTOMERS.BALANCE
    FROM CUSTOMERS
    LEFT JOIN
    CUSTOMERS_RECORD 
    ON CUSTOMERS.ACCOUNT_NUMBER = CUSTOMERS_RECORD.ACCOUNT_NUMBER'''
    mycursor.execute(sql)
    for i in mycursor.fetchall():
        print(i)
except Exception as e:
    print(f'{type(e).__name__}:--{e}')

(2222, 1, 'Noushad Khan', datetime.date(2018, 1, 1), Decimal('1000'), Decimal('3000'), 10000)
(2222, 2, 'Noushad Khan', datetime.date(2018, 1, 1), Decimal('1000'), Decimal('3000'), 10000)
(333, 3, 'a', None, None, None, 3000)
(444, 4, 'aa', None, None, None, 20000)
(222222, 5, 'fb', None, None, None, None)

# RIGHT JOIN

In [0]:
try:
    import mysql.connector
    mydb = mysql.connector.connect(
        host = 'localhost',
        user = 'root',
        passwd = 'hr5739',
        database = 'users'

    )
    mycursor = mydb.cursor()
    sql = '''SELECT CUSTOMERS.ACCOUNT_NUMBER, CUSTOMERS.ID, CUSTOMERS.NAME, CUSTOMERS_RECORD.DATE,
    CUSTOMERS_RECORD.CREDIT, CUSTOMERS_RECORD.DEBIT, CUSTOMERS.BALANCE
    FROM CUSTOMERS
    RIGHT JOIN
    CUSTOMERS_RECORD 
    ON CUSTOMERS.ACCOUNT_NUMBER = CUSTOMERS_RECORD.ACCOUNT_NUMBER'''
    mycursor.execute(sql)
    for i in mycursor.fetchall():
        print(i)
except Exception as e:
    print(f'{type(e).__name__}:--{e}')

(2222, 1, 'Noushad Khan', datetime.date(2018, 1, 1), Decimal('1000'), Decimal('3000'), 10000)
(2222, 2, 'Noushad Khan', datetime.date(2018, 1, 1), Decimal('1000'), Decimal('3000'), 10000)

# FULL JOIN

In [0]:
import getpass
p = getpass.getpass()
user = getpass.getpass()
try:
    import mysql.connector
    mydb = mysql.connector.connect(
        host = 'localhost',
        user = user,
        passwd = p,
        database = 'users'

    )
    mycursor = mydb.cursor()
    sql = '''SELECT *
    FROM CUSTOMERS
    FULL JOIN
    CUSTOMERS_RECORD 
    '''
    mycursor.execute(sql)
    for i in mycursor.fetchall():
        print(i)
except Exception as e:
    print(f'{type(e).__name__}:--{e}')

(2222, 'Noushad Khan', 'Noushadkhan1994@gmail.com', 'fdfdf', 'passowrd@1283434', 10000, 1, 1, datetime.date(2018, 1, 1), 2222, Decimal('1000'), Decimal('3000'))
(2222, 'Noushad Khan', 'Noushadkhan1994@gmail.com', 'fdfdf', 'passowrd@1283434', 10000, 2, 1, datetime.date(2018, 1, 1), 2222, Decimal('1000'), Decimal('3000'))
(333, 'a', 'b', 'c', 'd', 3000, 3, 1, datetime.date(2018, 1, 1), 2222, Decimal('1000'), Decimal('3000'))
(444, 'aa', 'bb', 'cc', 'dd', 20000, 4, 1, datetime.date(2018, 1, 1), 2222, Decimal('1000'), Decimal('3000'))
(222222, 'fb', 'fb@gmail.com', 'fdfdf', 'passowr', None, 5, 1, datetime.date(2018, 1, 1), 2222, Decimal('1000'), Decimal('3000'))

In [0]:
try:
    import mysql.connector
    mydb = mysql.connector.connect(
        host = 'localhost',
        user = 'root',
        passwd = 'hr5739',
        database = 'users'

    )
    mycursor = mydb.cursor()
    sql = '''SELECT *
       FROM CUSTOMERS
       LEFT JOIN
       CUSTOMERS_RECORD
       ON CUSTOMERS.ID = CUSTOMERS_RECORD.RID
    UNION ALL
       SELECT *
       FROM CUSTOMERS
       RIGHT JOIN
       CUSTOMERS_RECORD
       ON CUSTOMERS.ID = CUSTOMERS_RECORD.RID

    '''
    mycursor.execute(sql)
    for i in mycursor.fetchall():
        print(i)
except Exception as e:
    print(f'{type(e).__name__}:-- {e}')

(2222, 'Noushad Khan', 'Noushadkhan1994@gmail.com', 'fdfdf', 'passowrd@1283434', 10000, 1, 1, datetime.date(2018, 1, 1), 2222, Decimal('1000'), Decimal('3000'))
(2222, 'Noushad Khan', 'Noushadkhan1994@gmail.com', 'fdfdf', 'passowrd@1283434', 10000, 2, None, None, None, None, None)
(333, 'a', 'b', 'c', 'd', 3000, 3, None, None, None, None, None)
(444, 'aa', 'bb', 'cc', 'dd', 20000, 4, None, None, None, None, None)
(222222, 'fb', 'fb@gmail.com', 'fdfdf', 'passowr', None, 5, None, None, None, None, None)
(2222, 'Noushad Khan', 'Noushadkhan1994@gmail.com', 'fdfdf', 'passowrd@1283434', 10000, 1, 1, datetime.date(2018, 1, 1), 2222, Decimal('1000'), Decimal('3000'))

# BETWEEN
The **BETWEEN** operator allows you to specify a range to test. You often use the **BETWEEN** Operator in the **WHERE** cluse of the **SELECT**, **UPDATE**, and **DELETE** statement.